Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80100.h
/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PC12F_TCC4_WO0                         _UINT32_(76)
#define MUX_PC12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC12F_TCC4_WO0                      ((PIN_PC12F_TCC4_WO0 << 16) | MUX_PC12F_TCC4_WO0)
#define PORT_PC12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PC13F_TCC4_WO1                         _UINT32_(77)
#define MUX_PC13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PC13F_TCC4_WO1                      ((PIN_PC13F_TCC4_WO1 << 16) | MUX_PC13F_TCC4_WO1)
#define PORT_PC13F_TCC4_WO1                        (_UINT32_(1) << 13)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PC08F_TCC5_WO0                         _UINT32_(72)
#define MUX_PC08F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC08F_TCC5_WO0                      ((PIN_PC08F_TCC5_WO0 << 16) | MUX_PC08F_TCC5_WO0)
#define PORT_PC08F_TCC5_WO0                        (_UINT32_(1) << 8)

#define PIN_PC09F_TCC5_WO1                         _UINT32_(73)
#define MUX_PC09F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PC09F_TCC5_WO1                      ((PIN_PC09F_TCC5_WO1 << 16) | MUX_PC09F_TCC5_WO1)
#define PORT_PC09F_TCC5_WO1                        (_UINT32_(1) << 9)

/* ========== PORT definition for TCC6 peripheral ========== */
#define PIN_PC10F_TCC6_WO0                         _UINT32_(74)
#define MUX_PC10F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC10F_TCC6_WO0                      ((PIN_PC10F_TCC6_WO0 << 16) | MUX_PC10F_TCC6_WO0)
#define PORT_PC10F_TCC6_WO0                        (_UINT32_(1) << 10)

#define PIN_PC11F_TCC6_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC6_WO1                      ((PIN_PC11F_TCC6_WO1 << 16) | MUX_PC11F_TCC6_WO1)
#define PORT_PC11F_TCC6_WO1                        (_UINT32_(1) << 11)

/* ========== PORT definition for TCC7 peripheral ========== */
#define PIN_PD08F_TCC7_WO0                         _UINT32_(104)
#define MUX_PD08F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PD08F_TCC7_WO0                      ((PIN_PD08F_TCC7_WO0 << 16) | MUX_PD08F_TCC7_WO0)
#define PORT_PD08F_TCC7_WO0                        (_UINT32_(1) << 8)

#define PIN_PD07F_TCC7_WO1                         _UINT32_(103)
#define MUX_PD07F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PD07F_TCC7_WO1                      ((PIN_PD07F_TCC7_WO1 << 16) | MUX_PD07F_TCC7_WO1)
#define PORT_PD07F_TCC7_WO1                        (_UINT32_(1) << 7)

/* ========== PORT definition for TCC8 peripheral ========== */
#define PIN_PC14F_TCC8_WO0                         _UINT32_(78)
#define MUX_PC14F_TCC8_WO0                         _UINT32_(5) 
#define PINMUX_PC14F_TCC8_WO0                      ((PIN_PC14F_TCC8_WO0 << 16) | MUX_PC14F_TCC8_WO0)
#define PORT_PC14F_TCC8_WO0                        (_UINT32_(1) << 14)

#define PIN_PC15F_TCC8_WO1                         _UINT32_(79)
#define MUX_PC15F_TCC8_WO1                         _UINT32_(5) 
#define PINMUX_PC15F_TCC8_WO1                      ((PIN_PC15F_TCC8_WO1 << 16) | MUX_PC15F_TCC8_WO1)
#define PORT_PC15F_TCC8_WO1                        (_UINT32_(1) << 15)

/* ========== PORT definition for TCC9 peripheral ========== */
#define PIN_PD04F_TCC9_WO0                         _UINT32_(100)
#define MUX_PD04F_TCC9_WO0                         _UINT32_(5) 
#define PINMUX_PD04F_TCC9_WO0                      ((PIN_PD04F_TCC9_WO0 << 16) | MUX_PD04F_TCC9_WO0)
#define PORT_PD04F_TCC9_WO0                        (_UINT32_(1) << 4)

#define PIN_PD05F_TCC9_WO1                         _UINT32_(101)
#define MUX_PD05F_TCC9_WO1                         _UINT32_(5) 
#define PINMUX_PD05F_TCC9_WO1                      ((PIN_PD05F_TCC9_WO1 << 16) | MUX_PD05F_TCC9_WO1)
#define PORT_PD05F_TCC9_WO1                        (_UINT32_(1) << 5)

#define PIN_PD06F_TCC9_WO2                         _UINT32_(102)
#define MUX_PD06F_TCC9_WO2                         _UINT32_(5) 
#define PINMUX_PD06F_TCC9_WO2                      ((PIN_PD06F_TCC9_WO2 << 16) | MUX_PD06F_TCC9_WO2)
#define PORT_PD06F_TCC9_WO2                        (_UINT32_(1) << 6)

#define PIN_PD03F_TCC9_WO3                         _UINT32_(99)
#define MUX_PD03F_TCC9_WO3                         _UINT32_(5) 
#define PINMUX_PD03F_TCC9_WO3                      ((PIN_PD03F_TCC9_WO3 << 16) | MUX_PD03F_TCC9_WO3)
#define PORT_PD03F_TCC9_WO3                        (_UINT32_(1) << 3)

#define PIN_PD02F_TCC9_WO4                         _UINT32_(98)
#define MUX_PD02F_TCC9_WO4                         _UINT32_(5) 
#define PINMUX_PD02F_TCC9_WO4                      ((PIN_PD02F_TCC9_WO4 << 16) | MUX_PD02F_TCC9_WO4)
#define PORT_PD02F_TCC9_WO4                        (_UINT32_(1) << 2)

#define PIN_PC20F_TCC9_WO5                         _UINT32_(84)
#define MUX_PC20F_TCC9_WO5                         _UINT32_(5) 
#define PINMUX_PC20F_TCC9_WO5                      ((PIN_PC20F_TCC9_WO5 << 16) | MUX_PC20F_TCC9_WO5)
#define PORT_PC20F_TCC9_WO5                        (_UINT32_(1) << 20)



#endif /* _PIC32CZ4010CA80100_GPIO_H_ */

